PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_server.c
/***************************************************************************//**
* \file cy_crypto_server.c
* \version 2.150
*
* \brief
*  This file provides the source code to the API for Crypto Server
*  in the Crypto driver.
*
********************************************************************************
* \copyright
* Copyright (c) (2020-2024), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXCRYPTO)

#include "cy_crypto_server.h"

#if defined(__cplusplus)
extern "C" {
#endif

#include "cy_crypto_core_aes.h"
#include "cy_crypto_core_sha.h"
#include "cy_crypto_core_hmac.h"
#include "cy_crypto_core_cmac.h"
#include "cy_crypto_core_prng.h"
#include "cy_crypto_core_trng.h"
#include "cy_crypto_core_rsa.h"
#include "cy_crypto_core_mem.h"
#include "cy_crypto_core_crc.h"
#include "cy_crypto_core_des.h"
#include "cy_crypto_core_hw.h"
#include "cy_crypto_core_ecc.h"
#include "cy_ipc_drv.h"
#include "cy_sysint.h"
#include "cy_syslib.h"
#include <stdbool.h>
#include <string.h>

/* The pointer to the CRYPTO instance. */
#define CY_CRYPTO_BASE           (CRYPTO)

typedef struct
{
#if defined(CY_CRYPTO_CFG_PRNG_C)
    cy_crypto_prng_init_func_t   prngInitFunc;
    cy_crypto_prng_func_t        prngFunc;
#endif /* defined(CY_CRYPTO_CFG_PRNG_C) */
#if defined(CY_CRYPTO_CFG_TRNG_C)
    cy_crypto_trng_func_t        trngFunc;
#endif /* defined(CY_CRYPTO_CFG_TRNG_C) */
#if defined(CY_CRYPTO_CFG_AES_C)
    cy_crypto_aes_init_func_t    aesInitFunc;
    cy_crypto_aes_ecb_func_t     aesEcbFunc;
#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CBC)
    cy_crypto_aes_cbc_func_t     aesCbcFunc;
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CBC) */
#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CFB)
    cy_crypto_aes_cfb_func_t     aesCfbFunc;
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CFB) */
#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CTR)
    cy_crypto_aes_ctr_func_t     aesCtrFunc;
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CTR) */
#if defined(CY_CRYPTO_CFG_CMAC_C)
    cy_crypto_cmac_func_t        cmacFunc;
#endif /* defined(CY_CRYPTO_CFG_CMAC_C) */
#endif /* defined(CY_CRYPTO_CFG_AES_C) */
#if defined(CY_CRYPTO_CFG_SHA_C)
    cy_crypto_sha_func_t         shaFunc;
#if defined(CY_CRYPTO_CFG_HMAC_C)
    cy_crypto_hmac_func_t        hmacFunc;
#endif /* defined(CY_CRYPTO_CFG_HMAC_C) */
#endif /* defined(CY_CRYPTO_CFG_SHA_C) */
    cy_crypto_memcpy_func_t      memCpyFunc;
    cy_crypto_memset_func_t      memSetFunc;
    cy_crypto_memcmp_func_t      memCmpFunc;
    cy_crypto_memxor_func_t      memXorFunc;
#if defined(CY_CRYPTO_CFG_CRC_C)
    cy_crypto_crc_init_func_t    crcInitFunc;
    cy_crypto_crc_func_t         crcFunc;
#endif /* defined(CY_CRYPTO_CFG_CRC_C) */
#if defined(CY_CRYPTO_CFG_DES_C)
    cy_crypto_des_func_t         desFunc;
    cy_crypto_des_func_t         tdesFunc;
#endif /* defined(CY_CRYPTO_CFG_DES_C) */
#if defined(CY_CRYPTO_CFG_RSA_C)
    cy_crypto_rsa_proc_func_t    rsaProcFunc;
    cy_crypto_rsa_coef_func_t    rsaCoefFunc;
#if defined(CY_CRYPTO_CFG_RSA_VERIFY_ENABLED)
    cy_crypto_rsa_ver_func_t     rsaVerifyFunc;
#endif /* defined(CY_CRYPTO_CFG_RSA_VERIFY_ENABLED) */
#endif /* defined(CY_CRYPTO_CFG_RSA_C) */
} cy_stc_crypto_pfn_t;

static cy_stc_crypto_pfn_t const *cy_CryptoFunctionTable = NULL;

/*
 * The global variable to store a pointer to crypto processing context data.
 */
static cy_stc_crypto_context_t *processData = NULL;

static cy_stc_crypto_server_context_t *cy_crypto_serverContext;

/* Functions Prototypes */
static cy_en_crypto_status_t Cy_Crypto_Core_CheckHwForErrors(cy_stc_crypto_context_t *cryptoContext);

static cy_en_crypto_status_t Cy_Crypto_Server_Start_Common(cy_stc_crypto_config_t const *config,
        cy_stc_crypto_server_context_t *context);

cy_en_crypto_status_t Cy_Crypto_Server_Start(cy_stc_crypto_config_t const *config,
        cy_stc_crypto_server_context_t *context)
{
    cy_en_crypto_status_t status = CY_CRYPTO_HW_NOT_ENABLED;

#if defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
    static const cy_stc_crypto_pfn_t cryptoV1FullFuncs =
    {
#if defined(CY_CRYPTO_CFG_PRNG_C)
        &Cy_Crypto_Core_V1_Prng_Init,
        &Cy_Crypto_Core_V1_Prng,
#endif /* defined(CY_CRYPTO_CFG_PRNG_C) */
#if defined(CY_CRYPTO_CFG_TRNG_C)
        &Cy_Crypto_Core_Trng,
#endif /* defined(CY_CRYPTO_CFG_TRNG_C) */
#if defined(CY_CRYPTO_CFG_AES_C)
        &Cy_Crypto_Core_V1_Aes_Init,
        &Cy_Crypto_Core_V1_Aes_Ecb,
#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CBC)
        &Cy_Crypto_Core_V1_Aes_Cbc,
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CBC) */
#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CFB)
        &Cy_Crypto_Core_V1_Aes_Cfb,
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CFB) */
#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CTR)
        &Cy_Crypto_Core_V1_Aes_Ctr,
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CTR) */
#if defined(CY_CRYPTO_CFG_CMAC_C)
        &Cy_Crypto_Core_V1_Cmac,
#endif /* defined(CY_CRYPTO_CFG_CMAC_C) */
#endif /* defined(CY_CRYPTO_CFG_AES_C) */
#if defined(CY_CRYPTO_CFG_SHA_C)
        &Cy_Crypto_Core_V1_Sha,
#if defined(CY_CRYPTO_CFG_HMAC_C)
        &Cy_Crypto_Core_V1_Hmac,
#endif /* defined(CY_CRYPTO_CFG_HMAC_C) */
#endif /* defined(CY_CRYPTO_CFG_SHA_C) */
        &Cy_Crypto_Core_V1_MemCpy,
        &Cy_Crypto_Core_V1_MemSet,
        &Cy_Crypto_Core_V1_MemCmp,
        &Cy_Crypto_Core_V1_MemXor,
#if defined(CY_CRYPTO_CFG_CRC_C)
        &Cy_Crypto_Core_V1_Crc_Init,
        &Cy_Crypto_Core_V1_Crc,
#endif /* defined(CY_CRYPTO_CFG_CRC_C) */
#if defined(CY_CRYPTO_CFG_DES_C)
        &Cy_Crypto_Core_V1_Des,
        &Cy_Crypto_Core_V1_Tdes,
#endif /* defined(CY_CRYPTO_CFG_DES_C) */
#if defined(CY_CRYPTO_CFG_RSA_C)
        &Cy_Crypto_Core_Rsa_Proc,
        &Cy_Crypto_Core_Rsa_Coef,
#if defined(CY_CRYPTO_CFG_RSA_VERIFY_ENABLED)
        &Cy_Crypto_Core_Rsa_Verify,
#endif /* defined(CY_CRYPTO_CFG_RSA_VERIFY_ENABLED) */
#endif /* defined(CY_CRYPTO_CFG_RSA_C) */
    };
#endif /* defined(CY_CRYPTO_CFG_HW_V1_ENABLE) */

