PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_server.c
#if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)
    static const cy_stc_crypto_pfn_t cryptoV2FullFuncs =
    {
#if defined(CY_CRYPTO_CFG_PRNG_C)
        &Cy_Crypto_Core_V2_Prng_Init,
        &Cy_Crypto_Core_V2_Prng,
#endif /* defined(CY_CRYPTO_CFG_PRNG_C) */
#if defined(CY_CRYPTO_CFG_TRNG_C)
        &Cy_Crypto_Core_Trng,
#endif /* defined(CY_CRYPTO_CFG_TRNG_C) */
#if defined(CY_CRYPTO_CFG_AES_C)
        &Cy_Crypto_Core_V2_Aes_Init,
        &Cy_Crypto_Core_V2_Aes_Ecb,
#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CBC)
        &Cy_Crypto_Core_V2_Aes_Cbc,
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CBC) */
#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CFB)
        &Cy_Crypto_Core_V2_Aes_Cfb,
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CFB) */
#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CTR)
        &Cy_Crypto_Core_V2_Aes_Ctr,
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CTR) */
#if defined(CY_CRYPTO_CFG_CMAC_C)
        &Cy_Crypto_Core_V2_Cmac,
#endif /* defined(CY_CRYPTO_CFG_CMAC_C) */
#endif /* defined(CY_CRYPTO_CFG_AES_C) */
#if defined(CY_CRYPTO_CFG_SHA_C)
        &Cy_Crypto_Core_V2_Sha,
#if defined(CY_CRYPTO_CFG_HMAC_C)
        &Cy_Crypto_Core_V2_Hmac,
#endif /* defined(CY_CRYPTO_CFG_HMAC_C) */
#endif /* defined(CY_CRYPTO_CFG_SHA_C) */
        &Cy_Crypto_Core_V2_MemCpy,
        &Cy_Crypto_Core_V2_MemSet,
        &Cy_Crypto_Core_V2_MemCmp,
        &Cy_Crypto_Core_V2_MemXor,
#if defined(CY_CRYPTO_CFG_CRC_C)
        &Cy_Crypto_Core_V2_Crc_Init,
        &Cy_Crypto_Core_V2_Crc,
#endif /* defined(CY_CRYPTO_CFG_CRC_C) */
#if defined(CY_CRYPTO_CFG_DES_C)
        &Cy_Crypto_Core_V2_Des,
        &Cy_Crypto_Core_V2_Tdes,
#endif /* defined(CY_CRYPTO_CFG_DES_C) */
#if defined(CY_CRYPTO_CFG_RSA_C)
        &Cy_Crypto_Core_Rsa_Proc,
        &Cy_Crypto_Core_Rsa_Coef,
#if defined(CY_CRYPTO_CFG_RSA_VERIFY_ENABLED)
        &Cy_Crypto_Core_Rsa_Verify,
#endif /* defined(CY_CRYPTO_CFG_RSA_VERIFY_ENABLED) */
#endif /* defined(CY_CRYPTO_CFG_RSA_C) */
    };
#endif /* defined(CY_CRYPTO_CFG_HW_V2_ENABLE) */

    if (CY_CRYPTO_V1)
    {
#if defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
        cy_CryptoFunctionTable = &cryptoV1FullFuncs;
#endif /* defined(CY_CRYPTO_CFG_HW_V1_ENABLE) */
    }
    else
    {
#if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)
        cy_CryptoFunctionTable = &cryptoV2FullFuncs;
#endif /* defined(CY_CRYPTO_CFG_HW_V2_ENABLE) */
    }

    if (cy_CryptoFunctionTable != NULL)
    {
        status = Cy_Crypto_Server_Start_Common(config, context);
    }
    return status;
}

static cy_en_crypto_status_t Cy_Crypto_Server_Start_Common(cy_stc_crypto_config_t const *config,
        cy_stc_crypto_server_context_t *context)
{
    cy_israddress isrHandler;

    CY_ASSERT(NULL != config);
    CY_ASSERT(NULL != context);
    CY_ASSERT(NULL != cy_CryptoFunctionTable);

    context->ipcChannel = config->ipcChannel;
    context->acquireNotifierChannel = config->acquireNotifierChannel;
    context->getDataHandlerPtr  = config->userGetDataHandler;
    context->errorHandlerPtr    = config->userErrorHandler;
    context->isHwErrorOccured = false;
    context->acquireNotifierConfig.intrSrc = config->acquireNotifierConfig.intrSrc;
    context->cryptoErrorIntrConfig.intrSrc = config->cryptoErrorIntrConfig.intrSrc;

#if !defined(CY_CRYPTO_CFG_HW_USE_MPN_SPECIFIC)
    Cy_Crypto_Core_HwInit();
#endif

    /* Initialize the interrupt controller for CM0+ and IPC Interrupt */
    if (config->userGetDataHandler != NULL)
    {
        isrHandler = config->userGetDataHandler;
    }
    else
    {
        isrHandler = &Cy_Crypto_Server_GetDataHandler;
    }

    (void)Cy_SysInt_Init(&config->acquireNotifierConfig, isrHandler);

#if defined (CY_IP_M7CPUSS)
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to IRQn_Type enum.');
    NVIC_EnableIRQ((IRQn_Type)((config->acquireNotifierConfig.intrSrc >> 16) & 0x00FFUL));
#else
    NVIC_EnableIRQ(config->acquireNotifierConfig.intrSrc);
#endif


    /* Do not bring up an IPC release interrupt here, only set up a notify interrupt */
    Cy_IPC_Drv_SetInterruptMask(Cy_IPC_Drv_GetIntrBaseAddr(config->acquireNotifierChannel),
                                CY_IPC_NO_NOTIFICATION, (1uL << config->ipcChannel));

    /* Initialize and enable an interrupt to handle possible Crypto HW errors */
    if (config->userErrorHandler != NULL)
    {
        isrHandler = config->userErrorHandler;
    }
    else
    {
        isrHandler = &Cy_Crypto_Server_ErrorHandler;
    }

    (void)Cy_SysInt_Init(&config->cryptoErrorIntrConfig, isrHandler);

#if defined (CY_IP_M7CPUSS)
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to IRQn_Type enum.');
    NVIC_ClearPendingIRQ((IRQn_Type)((config->cryptoErrorIntrConfig.intrSrc >> 16) & 0x00FFUL));

    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to IRQn_Type enum.');
    NVIC_EnableIRQ((IRQn_Type)((config->cryptoErrorIntrConfig.intrSrc >> 16) & 0x00FFUL));
#else
    NVIC_ClearPendingIRQ(config->cryptoErrorIntrConfig.intrSrc);
    NVIC_EnableIRQ(config->cryptoErrorIntrConfig.intrSrc);
#endif /* (CY_IP_M7CPUSS) */

    Cy_Crypto_Core_SetInterruptMask(CY_CRYPTO_BASE, CY_CRYPTO_INTR_MASK_ERROR_MASK);

    cy_crypto_serverContext = context;

    return (CY_CRYPTO_SUCCESS);
}

cy_en_crypto_status_t Cy_Crypto_Server_Stop(void)
{
    if (NULL != cy_crypto_serverContext)
    {
        uint32_t interruptMask;

#if defined (CY_IP_M7CPUSS)
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to IRQn_Type enum.');
        NVIC_DisableIRQ((IRQn_Type)((cy_crypto_serverContext->acquireNotifierConfig.intrSrc >> 16) & 0x00FFUL));

        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to IRQn_Type enum.');
        NVIC_ClearPendingIRQ((IRQn_Type)((cy_crypto_serverContext->acquireNotifierConfig.intrSrc >> 16) & 0x00FFUL));

        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to IRQn_Type enum.');
        NVIC_DisableIRQ((IRQn_Type)((cy_crypto_serverContext->cryptoErrorIntrConfig.intrSrc >> 16) & 0x00FFUL));

        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to IRQn_Type enum.');
        NVIC_ClearPendingIRQ((IRQn_Type)((cy_crypto_serverContext->cryptoErrorIntrConfig.intrSrc >> 16) & 0x00FFUL));
#else

