PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_server.c
        /* Disable the Notify interrupt from IPC */
        NVIC_DisableIRQ(cy_crypto_serverContext->acquireNotifierConfig.intrSrc);
        NVIC_ClearPendingIRQ(cy_crypto_serverContext->acquireNotifierConfig.intrSrc);

        /* Disable the Error interrupt from Crypto */
        NVIC_DisableIRQ(cy_crypto_serverContext->cryptoErrorIntrConfig.intrSrc);
        NVIC_ClearPendingIRQ(cy_crypto_serverContext->cryptoErrorIntrConfig.intrSrc);
#endif /* (CY_IP_M7CPUSS) */

        Cy_Crypto_Core_SetInterruptMask(CY_CRYPTO_BASE, 0u);

        /* Disable CRYPTO IPC interrupt */
        interruptMask = Cy_IPC_Drv_ExtractAcquireMask(Cy_IPC_Drv_GetInterruptMask(Cy_IPC_Drv_GetIntrBaseAddr(cy_crypto_serverContext->acquireNotifierChannel)));

        Cy_IPC_Drv_SetInterruptMask(Cy_IPC_Drv_GetIntrBaseAddr(cy_crypto_serverContext->acquireNotifierChannel),
                                    CY_IPC_NO_NOTIFICATION,
                                    interruptMask & ~(1uL << cy_crypto_serverContext->ipcChannel));

        cy_crypto_serverContext->getDataHandlerPtr = NULL;
        cy_crypto_serverContext->errorHandlerPtr = NULL;
        cy_crypto_serverContext = NULL;
        cy_CryptoFunctionTable  = NULL;
    }

    return (CY_CRYPTO_SUCCESS);
}

void Cy_Crypto_Server_ErrorHandler(void)
{
    uint32_t interrupts;
    interrupts = Cy_Crypto_Core_GetInterruptStatus(CY_CRYPTO_BASE) & CY_CRYPTO_INTR_ERROR_MASK;

    if (interrupts != 0u)
    {
        Cy_Crypto_Core_ClearInterrupt(CY_CRYPTO_BASE, interrupts);

        if (false == cy_crypto_serverContext->isHwErrorOccured)
        {
            /* HW error is not captured before */
            cy_crypto_serverContext->hwErrorStatus.errorStatus0 = REG_CRYPTO_ERROR_STATUS0(CY_CRYPTO_BASE);
            cy_crypto_serverContext->hwErrorStatus.errorStatus1 = REG_CRYPTO_ERROR_STATUS1(CY_CRYPTO_BASE);

            cy_crypto_serverContext->isHwErrorOccured = true;
        }
        else
        {
            /* HW error is already captured by Cy_Crypto_Core_CheckHwForErrors function */
            cy_crypto_serverContext->isHwErrorOccured = false;
        }
    }
}

void Cy_Crypto_Server_Process(void)
{
    cy_stc_crypto_context_t *myData = processData;

    if (myData != NULL)
    {
        /* Default error */
        myData->resp = CY_CRYPTO_HW_NOT_ENABLED;

        if (CY_CRYPTO_INSTR_ENABLE == myData->instr)
        {
            myData->resp = Cy_Crypto_Core_Enable(CY_CRYPTO_BASE);
        }
        else
        {
            /* Check if Crypto HW is enabled */
            if (Cy_Crypto_Core_IsEnabled(CY_CRYPTO_BASE))
            {
                myData->resp = CY_CRYPTO_NOT_SUPPORTED;

                if (NULL != cy_CryptoFunctionTable)
                {
                    switch (myData->instr)
                    {
                    case CY_CRYPTO_INSTR_DISABLE:
                        myData->resp = Cy_Crypto_Core_Disable(CY_CRYPTO_BASE);
                        break;

                    case CY_CRYPTO_INSTR_SRV_INFO:
                        myData->resp = Cy_Crypto_Core_GetLibInfo((cy_en_crypto_lib_info_t*)myData->xdata);
                        break;

                        /* MEM_BUFF memory management */
#if defined(CY_CRYPTO_CFG_RSA_C)
                    case CY_CRYPTO_INSTR_MEMBUF_SET:
                    {
                        cy_stc_crypto_context_str_t *cfContext = myData->xdata;
                        myData->resp = Cy_Crypto_Core_SetVuMemoryAddress(CY_CRYPTO_BASE, cfContext->src0, cfContext->dataSize);
                    }
                    break;

                    case CY_CRYPTO_INSTR_MEMBUF_ADDR:
                    {
                        cy_stc_crypto_context_str_t *cfContext = myData->xdata;
                        *(uint32_t *)(cfContext->dst) = (uint32_t)Cy_Crypto_Core_GetVuMemoryAddress(CY_CRYPTO_BASE);
                        myData->resp = CY_CRYPTO_SUCCESS;
                    }
                    break;

                    case CY_CRYPTO_INSTR_MEMBUF_SIZE:
                    {
                        cy_stc_crypto_context_str_t *cfContext = myData->xdata;
                        *(uint32_t *)(cfContext->dst) = Cy_Crypto_Core_GetVuMemorySize(CY_CRYPTO_BASE);
                        myData->resp = CY_CRYPTO_SUCCESS;
                    }
                    break;
#endif /* defined(CY_CRYPTO_CFG_RSA_C) */

#if defined(CY_CRYPTO_CFG_PRNG_C)
                    case CY_CRYPTO_INSTR_PRNG_INIT:
                        if (NULL != cy_CryptoFunctionTable->prngInitFunc)
                        {
                            cy_stc_crypto_context_prng_t *cfContext = myData->xdata;
                            myData->resp = (cy_CryptoFunctionTable->prngInitFunc)(CY_CRYPTO_BASE,
                                           cfContext->lfsr32InitState, cfContext->lfsr31InitState, cfContext->lfsr29InitState);
                        }
                        break;

                    case CY_CRYPTO_INSTR_PRNG:
                        if (NULL != cy_CryptoFunctionTable->prngFunc)
                        {
                            cy_stc_crypto_context_prng_t *cfContext = myData->xdata;
                            myData->resp = (cy_CryptoFunctionTable->prngFunc)(CY_CRYPTO_BASE,
                                           cfContext->max, cfContext->prngNum);
                        }
                        break;
#endif /* defined(CY_CRYPTO_CFG_PRNG_C) */

#if defined(CY_CRYPTO_CFG_TRNG_C)
                    case CY_CRYPTO_INSTR_TRNG:
                        if (NULL != cy_CryptoFunctionTable->trngFunc)
                        {
                            cy_stc_crypto_context_trng_t *cfContext = myData->xdata;
                            myData->resp = (cy_CryptoFunctionTable->trngFunc)(CY_CRYPTO_BASE,
                                           cfContext->GAROPol, cfContext->FIROPol, cfContext->max, cfContext->trngNum);
                        }
                        break;
#endif /* defined(CY_CRYPTO_CFG_TRNG_C) */

#if defined(CY_CRYPTO_CFG_AES_C)
                    case CY_CRYPTO_INSTR_AES_INIT:
                        if (NULL != cy_CryptoFunctionTable->aesInitFunc)
                        {
                            cy_stc_crypto_context_aes_t *cfContext = (cy_stc_crypto_context_aes_t *)myData->xdata;
                            myData->resp =
                                (cy_CryptoFunctionTable->aesInitFunc)(CY_CRYPTO_BASE,
                                    (uint8_t*)cfContext->key, cfContext->keyLength, &cfContext->aesState, (cy_stc_crypto_aes_buffers_t *)((void *)(Cy_Crypto_Core_GetVuMemoryAddress(CY_CRYPTO_BASE))));
                        }
                        break;

