PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_server.c
                    case CY_CRYPTO_INSTR_AES_ECB:
                        if (NULL != cy_CryptoFunctionTable->aesEcbFunc)
                        {
                            cy_stc_crypto_context_aes_t *cfContext = (cy_stc_crypto_context_aes_t *)myData->xdata;
                            myData->resp =
                                (cy_CryptoFunctionTable->aesEcbFunc)(CY_CRYPTO_BASE,
                                    cfContext->dirMode,
                                    (uint8_t*)cfContext->dst,
                                    (uint8_t*)cfContext->src,
                                    &cfContext->aesState);
                        }
                        break;

#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CBC)
                    case CY_CRYPTO_INSTR_AES_CBC:
                        if (NULL != cy_CryptoFunctionTable->aesCbcFunc)
                        {
                            cy_stc_crypto_context_aes_t *cfContext = (cy_stc_crypto_context_aes_t *)myData->xdata;
                            myData->resp =
                                (cy_CryptoFunctionTable->aesCbcFunc)(CY_CRYPTO_BASE,
                                    cfContext->dirMode,
                                    cfContext->srcSize,
                                    (uint8_t*)cfContext->ivPtr,
                                    (uint8_t*)cfContext->dst,
                                    (uint8_t*)cfContext->src,
                                    &cfContext->aesState);
                        }
                        break;
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CBC) */

#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CFB)
                    case CY_CRYPTO_INSTR_AES_CFB:
                        if (NULL != cy_CryptoFunctionTable->aesCfbFunc)
                        {
                            cy_stc_crypto_context_aes_t *cfContext = (cy_stc_crypto_context_aes_t *)myData->xdata;
                            myData->resp =
                                (cy_CryptoFunctionTable->aesCfbFunc)(CY_CRYPTO_BASE,
                                    cfContext->dirMode,
                                    cfContext->srcSize,
                                    (uint8_t*)cfContext->ivPtr,
                                    (uint8_t*)cfContext->dst,
                                    (uint8_t*)cfContext->src,
                                    &cfContext->aesState);
                        }
                        break;
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CFB) */

#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CTR)
                    case CY_CRYPTO_INSTR_AES_CTR:
                        if (NULL != cy_CryptoFunctionTable->aesCtrFunc)
                        {
                            cy_stc_crypto_context_aes_t *cfContext = (cy_stc_crypto_context_aes_t *)myData->xdata;
                            myData->resp =
                                (cy_CryptoFunctionTable->aesCtrFunc)(CY_CRYPTO_BASE,
                                    cfContext->srcSize,
                                    cfContext->srcOffset,
                                    (uint8_t*)cfContext->ivPtr,
                                    (uint8_t*)cfContext->streamBlock,
                                    (uint8_t*)cfContext->dst,
                                    (uint8_t*)cfContext->src,
                                    &cfContext->aesState);
                        }
                        break;
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CTR) */
#endif /* defined(CY_CRYPTO_CFG_AES_C) */

#if defined(CY_CRYPTO_CFG_CMAC_C)
                    case CY_CRYPTO_INSTR_CMAC:
                        if (NULL != cy_CryptoFunctionTable->cmacFunc)
                        {
                            cy_stc_crypto_context_aes_t *cfContext = myData->xdata;
                            myData->resp = (cy_CryptoFunctionTable->cmacFunc)(CY_CRYPTO_BASE,
                                           (uint8_t*)cfContext->src, cfContext->srcSize, (uint8_t*)cfContext->key, cfContext->keyLength,
                                           (uint8_t*)cfContext->dst, &cfContext->aesState);
                        }
                        break;
#endif /* defined(CY_CRYPTO_CFG_CMAC_C) */

#if defined(CY_CRYPTO_CFG_SHA_C)
                    case CY_CRYPTO_INSTR_SHA:
                        if (NULL != cy_CryptoFunctionTable->shaFunc)
                        {
                            cy_stc_crypto_context_sha_t *cfContext = myData->xdata;
                            myData->resp = (cy_CryptoFunctionTable->shaFunc)(CY_CRYPTO_BASE,
                                           (uint8_t *)cfContext->message, cfContext->messageSize,
                                           (uint8_t *)cfContext->dst, cfContext->mode);
                        }
                        break;
#endif /* defined(CY_CRYPTO_CFG_SHA_C) */

#if defined(CY_CRYPTO_CFG_HMAC_C)
                    case CY_CRYPTO_INSTR_HMAC:
                        if (NULL != cy_CryptoFunctionTable->hmacFunc)
                        {
                            cy_stc_crypto_context_sha_t *cfContext = myData->xdata;
                            myData->resp = (cy_CryptoFunctionTable->hmacFunc)(CY_CRYPTO_BASE,
                                           (uint8_t *)cfContext->dst, (uint8_t *)cfContext->message, cfContext->messageSize,
                                           (uint8_t *)cfContext->key, cfContext->keyLength, cfContext->mode);
                        }
                        break;
#endif /* defined(CY_CRYPTO_CFG_HMAC_C) */

                    case CY_CRYPTO_INSTR_MEM_CPY:
                        if (NULL != cy_CryptoFunctionTable->memCpyFunc)
                        {
                            cy_stc_crypto_context_str_t *cfContext = myData->xdata;
                            (cy_CryptoFunctionTable->memCpyFunc)(CY_CRYPTO_BASE,
                                                                 cfContext->dst, cfContext->src0, (uint16_t)cfContext->dataSize);
                            myData->resp = CY_CRYPTO_SUCCESS;
                        }
                        break;

                    case CY_CRYPTO_INSTR_MEM_SET:
                        if (NULL != cy_CryptoFunctionTable->memSetFunc)
                        {
                            cy_stc_crypto_context_str_t *cfContext = myData->xdata;
                            (cy_CryptoFunctionTable->memSetFunc)(CY_CRYPTO_BASE,
                                                                 cfContext->dst, (uint8_t)cfContext->data, (uint16_t)cfContext->dataSize);
                            myData->resp = CY_CRYPTO_SUCCESS;
                        }
                        break;

                    case CY_CRYPTO_INSTR_MEM_CMP:
                        if (NULL != cy_CryptoFunctionTable->memCmpFunc)
                        {
                            cy_stc_crypto_context_str_t *cfContext = myData->xdata;
                            *(uint32_t *)(cfContext->dst) =
                                (cy_CryptoFunctionTable->memCmpFunc)(CY_CRYPTO_BASE,
                                    cfContext->src0, cfContext->src1, (uint16_t)cfContext->dataSize);
                            myData->resp = CY_CRYPTO_SUCCESS;
                        }
                        break;

                    case CY_CRYPTO_INSTR_MEM_XOR:
                        if (NULL != cy_CryptoFunctionTable->memXorFunc)
                        {
                            cy_stc_crypto_context_str_t *cfContext = myData->xdata;
                            (cy_CryptoFunctionTable->memXorFunc)(CY_CRYPTO_BASE,
                                                                 cfContext->dst, cfContext->src0, cfContext->src1, (uint16_t)cfContext->dataSize);
                            myData->resp = CY_CRYPTO_SUCCESS;
                        }
                        break;

#if defined(CY_CRYPTO_CFG_CRC_C)
                    case CY_CRYPTO_INSTR_CRC_INIT:
                        if (NULL != cy_CryptoFunctionTable->crcInitFunc)
                        {
                            cy_stc_crypto_context_crc_t *cfContext = myData->xdata;
                            myData->resp = (cy_CryptoFunctionTable->crcInitFunc)(CY_CRYPTO_BASE,
                                           cfContext->polynomial, cfContext->dataReverse, cfContext->dataXor, cfContext->remReverse, cfContext->remXor);
                        }
                        break;

                    case CY_CRYPTO_INSTR_CRC:
                        if (NULL != cy_CryptoFunctionTable->crcFunc)
                        {
                            cy_stc_crypto_context_crc_t *cfContext = myData->xdata;
                            myData->resp = (cy_CryptoFunctionTable->crcFunc)(CY_CRYPTO_BASE,
                                           cfContext->crc, cfContext->data, cfContext->dataSize, cfContext->lfsrInitState);
                        }
                        break;
#endif /* defined(CY_CRYPTO_CFG_CRC_C) */

