PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_server.c
#if defined(CY_CRYPTO_CFG_DES_C)
                    case CY_CRYPTO_INSTR_DES:
                        if (NULL != cy_CryptoFunctionTable->desFunc)
                        {
                            cy_stc_crypto_context_des_t *cfContext = myData->xdata;
                            myData->resp = (cy_CryptoFunctionTable->desFunc)(CY_CRYPTO_BASE,
                                           cfContext->dirMode, (uint8_t const *)cfContext->key, (uint8_t *)cfContext->dst, (uint8_t const *)cfContext->src);
                        }
                        break;

                    case CY_CRYPTO_INSTR_3DES:
                        if (NULL != cy_CryptoFunctionTable->tdesFunc)
                        {
                            cy_stc_crypto_context_des_t *cfContext = myData->xdata;
                            myData->resp = (cy_CryptoFunctionTable->tdesFunc)(CY_CRYPTO_BASE,
                                           cfContext->dirMode, (uint8_t const *)cfContext->key, (uint8_t *)cfContext->dst, (uint8_t  const *)cfContext->src);
                        }
                        break;
#endif /* defined(CY_CRYPTO_CFG_DES_C) */

#if defined(CY_CRYPTO_CFG_RSA_C)
                    case CY_CRYPTO_INSTR_RSA_PROC:
                        if (NULL != cy_CryptoFunctionTable->rsaProcFunc)
                        {
                            cy_stc_crypto_context_rsa_t *cfContext = myData->xdata;
                            myData->resp = (cy_CryptoFunctionTable->rsaProcFunc)(CY_CRYPTO_BASE,
                                           cfContext->key, (uint8_t const *)cfContext->message, cfContext->messageSize, (uint8_t *)cfContext->result);
                        }
                        break;

                    case CY_CRYPTO_INSTR_RSA_COEF:
                        if (NULL != cy_CryptoFunctionTable->rsaCoefFunc)
                        {
                            cy_stc_crypto_context_rsa_t *cfContext = myData->xdata;
                            myData->resp = (cy_CryptoFunctionTable->rsaCoefFunc)(CY_CRYPTO_BASE, cfContext->key);
                        }
                        break;

#if defined(CY_CRYPTO_CFG_RSA_VERIFY_ENABLED)
                    case CY_CRYPTO_INSTR_RSA_VER:
                        if (NULL != cy_CryptoFunctionTable->rsaVerifyFunc)
                        {
                            cy_stc_crypto_context_rsa_ver_t *cfContext = myData->xdata;
                            myData->resp = (cy_CryptoFunctionTable->rsaVerifyFunc)(CY_CRYPTO_BASE,
                                           cfContext->verResult, cfContext->digestType, (uint8_t const *)cfContext->hash,
                                           (uint8_t const *)cfContext->decryptedSignature, cfContext->decryptedSignatureLength);
                        }
                        break;
#endif /* defined(CY_CRYPTO_CFG_RSA_VERIFY_ENABLED) */
#endif /* defined(CY_CRYPTO_CFG_RSA_C) */

#if defined(CY_CRYPTO_CFG_ECDSA_SIGN_C)
                    case CY_CRYPTO_INSTR_ECDSA_SIGN:
                    {
                        cy_stc_crypto_context_ecc_t *cfContext = myData->xdata;
                        myData->resp = Cy_Crypto_Core_ECC_SignHash(CY_CRYPTO_BASE,
                                       cfContext->src0, cfContext->datalen, cfContext->dst0,
                                       cfContext->key, cfContext->src1);
                    }
                    break;
#endif /* defined(CY_CRYPTO_CFG_ECDSA_SIGN_C) */

#if defined(CY_CRYPTO_CFG_ECDSA_VERIFY_C)
                    case CY_CRYPTO_INSTR_ECDSA_VER:
                    {
                        cy_stc_crypto_context_ecc_t *cfContext = myData->xdata;
                        myData->resp = Cy_Crypto_Core_ECC_VerifyHash(CY_CRYPTO_BASE,
                                       cfContext->src1, cfContext->src0, cfContext->datalen,
                                       cfContext->dst0, cfContext->key);
                    }
                    break;
#endif /* defined(CY_CRYPTO_CFG_ECDSA_VERIFY_C) */

                    default:
                        myData->resp = CY_CRYPTO_NOT_SUPPORTED;
                        break;
                    }
                }

                if (CY_CRYPTO_SUCCESS == myData->resp)
                {
                    myData->resp = Cy_Crypto_Core_CheckHwForErrors(myData);
                }
            }
        }

        processData = NULL;

        /* Release the Crypto IPC channel with the Release interrupt */
        (void)Cy_IPC_Drv_LockRelease(Cy_IPC_Drv_GetIpcBaseAddress(myData->ipcChannel),
                                     (NULL != myData->userCompleteCallback) ? (1uL << myData->releaseNotifierChannel) : CY_IPC_NO_NOTIFICATION);
    }
}

void Cy_Crypto_Server_GetDataHandler(void)
{
    uint32_t interruptMasked;

    /*
     * Check that there is really the IPC Crypto Notify interrupt,
     * because the same line can be used for the IPC Crypto Release interrupt.
     */

    interruptMasked = Cy_IPC_Drv_ExtractAcquireMask(Cy_IPC_Drv_GetInterruptStatusMasked(
                          Cy_IPC_Drv_GetIntrBaseAddr(cy_crypto_serverContext->acquireNotifierChannel)));

    if ((1uL << (cy_crypto_serverContext->ipcChannel)) == interruptMasked)
    {
        Cy_IPC_Drv_ClearInterrupt(Cy_IPC_Drv_GetIntrBaseAddr(cy_crypto_serverContext->acquireNotifierChannel), CY_IPC_NO_NOTIFICATION, interruptMasked);

        if (CY_IPC_DRV_SUCCESS == Cy_IPC_Drv_ReadMsgPtr(Cy_IPC_Drv_GetIpcBaseAddress(cy_crypto_serverContext->ipcChannel), (void * *)&processData))
        {
            if (cy_crypto_serverContext->getDataHandlerPtr == NULL)
            {
                Cy_Crypto_Server_Process();
            }
        }
    }
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_CheckHwForErrors
****************************************************************************//**
*
* The function checks if a Crypto HW error occurred. If yes, copies the error
* information from the Crypto registers to the communication structure.
*
* This function available for CM0+ core only.
*
* This function is internal and should not to be called directly by user software
*
* \param cryptoContext
* The pointer to cy_stc_crypto_context_t structure which stores
* the Crypto driver context.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_CheckHwForErrors(cy_stc_crypto_context_t *cryptoContext)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_SUCCESS;
    uint32_t myErrorStatus0;
    uint32_t myErrorStatus1;

    CY_ASSERT(NULL != cryptoContext);

    if (false == cy_crypto_serverContext->isHwErrorOccured)
    {
        /* HW error is not captured before */
        myErrorStatus0 = REG_CRYPTO_ERROR_STATUS0(CY_CRYPTO_BASE);
        myErrorStatus1 = REG_CRYPTO_ERROR_STATUS1(CY_CRYPTO_BASE);

        if (_FLD2VAL(CRYPTO_ERROR_STATUS1_VALID, myErrorStatus1) == 1u)
        {
            tmpResult = CY_CRYPTO_HW_ERROR;

            cy_crypto_serverContext->isHwErrorOccured = true;
        }
    }
    else
    {
        /* HW error is already captured by error interrupt handler */
        myErrorStatus0 = cy_crypto_serverContext->hwErrorStatus.errorStatus0;
        myErrorStatus1 = cy_crypto_serverContext->hwErrorStatus.errorStatus1;

        if (_FLD2VAL(CRYPTO_ERROR_STATUS1_VALID, myErrorStatus1) == 1u)
        {
            tmpResult = CY_CRYPTO_HW_ERROR;
        }

        cy_crypto_serverContext->isHwErrorOccured = false;
    }

    cryptoContext->hwErrorStatus.errorStatus0 = myErrorStatus0;
    cryptoContext->hwErrorStatus.errorStatus1 = myErrorStatus1;

    return (tmpResult);
}

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXCRYPTO */


/* [] END OF FILE */
